app/views/careers/index.html.erb

SELECT COUNT(*) FROM "videos" WHERE "videos"."career_id" = $1  [["career_id", 17]]
---
        <i class="fas fa-video">
          <%= career.videos.count %>