app/controllers/careers_controller.rb

SELECT "careers".* FROM "careers" WHERE (name ILIKE '%%') ORDER BY created_at DESC
---
  def index
    @careers = Career.all

SELECT  "careers".* FROM "careers" WHERE "careers"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "videos".* FROM "videos" WHERE "videos"."career_id" = $1 ORDER BY "videos"."id" ASC LIMIT $2  [["career_id", 3], ["LIMIT", 1]]
---
  def show
    @career = Career.find(params[:id])
    @videos = Video.where(career_id: params[:id])

INSERT INTO "careers" ("name", "description", "education_req", "created_at", "updated_at", "career_image") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "asdf"], ["description", "adsf"], ["education_req", "Associates Degree"], ["created_at", 2017-08-10 22:34:55 UTC], ["updated_at", 2017-08-10 22:34:55 UTC], ["career_image", "14dhwe.jpg"]]
---
  def create
    @career = Career.new(video_params)
    if @career.save