app/controllers/videos_controller.rb

  def index
    @videos = Video.all.includes(:videos)
---
SELECT "videos".* FROM "videos"

  def new
    @id = params[:career_id]
    @video = Video.new
    @career = Career.find(params[:career_id])
---
SELECT  "careers".* FROM "careers" WHERE "careers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @video = Video.new(video_params)
    if @video.save
      flash[:notice] = 'Video was successfully added.'
      @career = Career.find(params[:video][:career_id])
---
INSERT INTO "videos" ("name", "embbed_code", "created_at", "updated_at", "career_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "asdf"], ["embbed_code", "7dZHe5g8ec0"], ["created_at", 2017-08-07 13:01:52 UTC], ["updated_at", 2017-08-07 13:01:52 UTC], ["career_id", 2]]
SELECT  "careers".* FROM "careers" WHERE "careers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]