app/controllers/videos_controller.rb

  def index
    @videos = Video.where(career_id: params[:id])
---
SELECT "videos".* FROM "videos" WHERE "videos"."career_id" IS NULL